full_load_test_complete_results.txt
Токен получен
=== Длительный тест: GET /api/v1/projects (c=20, d=60) ===
Running 60s test @ http://localhost:5000/api/v1/projects
20 connections


┌─────────┬─────────┬─────────┬─────────┬─────────┬────────────┬───────────┬─────────┐
│ Stat    │ 2.5%    │ 50%     │ 97.5%   │ 99%     │ Avg        │ Stdev     │ Max     │
├─────────┼─────────┼─────────┼─────────┼─────────┼────────────┼───────────┼─────────┤
│ Latency │ 1250 ms │ 1843 ms │ 2369 ms │ 2535 ms │ 1837.69 ms │ 277.75 ms │ 3017 ms │
└─────────┴─────────┴─────────┴─────────┴─────────┴────────────┴───────────┴─────────┘
┌───────────┬─────────┬─────────┬─────────┬───────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5% │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼───────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 7       │ 9       │ 11      │ 12    │ 10,8    │ 0,84    │ 7       │
├───────────┼─────────┼─────────┼─────────┼───────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 8.77 MB │ 11.3 MB │ 13.8 MB │ 15 MB │ 13.5 MB │ 1.04 MB │ 8.76 MB │
└───────────┴─────────┴─────────┴─────────┴───────┴─────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 60

668 requests in 60.53s, 811 MB read
=== Длительный тест: GET /api/v1/resumes (c=20, d=60) ===
Running 60s test @ http://localhost:5000/api/v1/resumes
20 connections


┌─────────┬───────┬───────┬───────┬───────┬──────────┬─────────┬─────────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5% │ 99%   │ Avg      │ Stdev   │ Max     │
├─────────┼───────┼───────┼───────┼───────┼──────────┼─────────┼─────────┤
│ Latency │ 32 ms │ 42 ms │ 55 ms │ 60 ms │ 43.29 ms │ 33.1 ms │ 1247 ms │
└─────────┴───────┴───────┴───────┴───────┴──────────┴─────────┴─────────┘
┌───────────┬─────┬────────┬────────┬────────┬────────┬─────────┬────────┐
│ Stat      │ 1%  │ 2.5%   │ 50%    │ 97.5%  │ Avg    │ Stdev   │ Min    │
├───────────┼─────┼────────┼────────┼────────┼────────┼─────────┼────────┤
│ Req/Sec   │ 0   │ 305    │ 474    │ 500    │ 457,29 │ 68,57   │ 305    │
├───────────┼─────┼────────┼────────┼────────┼────────┼─────────┼────────┤
│ Bytes/Sec │ 0 B │ 317 kB │ 492 kB │ 519 kB │ 475 kB │ 71.2 kB │ 317 kB │
└───────────┴─────┴────────┴────────┴────────┴────────┴─────────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 60

27k requests in 60.14s, 28.5 MB read
=== Длительный тест: GET /api/v1/skills (c=20, d=60) ===
Running 60s test @ http://localhost:5000/api/v1/skills
20 connections